import os
import sys

import psycopg2
from psycopg2 import Error

from config_data.config import USER, PASSWORD, HOST, PORT, DATABASE

sys.path.append(os.getcwd())


def cities():
    connection = None
    cursor = None
    try:
        # Подключиться к существующей базе данных
        connection = psycopg2.connect(user=USER,
                                      # пароль, который указали при установке PostgreSQL
                                      password=PASSWORD,
                                      host=HOST,
                                      port=PORT,
                                      database=DATABASE)

        # Создайте курсор для выполнения операций с базой данных
        cursor = connection.cursor()

        # Вставьте данные в таблицу
        insert_query = f'''INSERT INTO cities (id_city, city) VALUES ({id_city}, '{city}')'''
        cursor.execute(insert_query)
        connection.commit()
        print("таблица успешно заполнена")

    except (Exception, Error) as error:
        print("Ошибка при работе с PostgreSQL", error)
    finally:
        if connection:
            cursor.close()
            connection.close()
            print("Соединение с PostgreSQL закрыто")


city = {'1': 'Москва', '2': 'Санкт-Петербург', '3': 'Екатеринбург', '4': 'Новосибирск',
        '8': 'Майкоп', '10': 'Горно-Алтайск', '11': 'Барнаул', '12': 'Благовещенск (Амурская область)',
        '14': 'Архангельск', '15': 'Астрахань', '17': 'Белгород', '19': 'Брянск', '20': 'Улан-Удэ',
        '22': 'Владивосток', '23': 'Владимир', '24': 'Волгоград', '25': 'Вологда', '26': 'Воронеж',
        '29': 'Махачкала', '31': 'Биробиджан', '32': 'Иваново (Ивановская область)', '34': 'Магас',
        '35': 'Иркутск', '39': 'Нальчик', '41': 'Калининград', '42': 'Элиста', '43': 'Калуга',
        '44': 'Петропавловск-Камчатский', '46': 'Черкесск', '47': 'Кемерово', '49': 'Киров (Кировская область)',
        '51': 'Сыктывкар', '52': 'Кострома', '53': 'Краснодар', '54': 'Красноярск', '55': 'Курган', '56': 'Курск',
        '58': 'Липецк', '60': 'Магадан', '61': 'Йошкар-Ола', '63': 'Саранск', '64': 'Мурманск',
        '66': 'Нижний Новгород', '67': 'Великий Новгород', '68': 'Омск', '69': 'Орел', '70': 'Оренбург',
        '71': 'Пенза', '72': 'Пермь', '73': 'Петрозаводск', '75': 'Псков', '76': 'Ростов-на-Дону', '77': 'Рязань',
        '78': 'Самара', '79': 'Саратов', '80': 'Якутск', '81': 'Южно-Сахалинск', '82': 'Владикавказ', '83': 'Смоленск',
        '84': 'Ставрополь', '87': 'Тамбов', '88': 'Казань', '89': 'Тверь', '90': 'Томск', '91': 'Кызыл', '92': 'Тула',
        '95': 'Тюмень', '96': 'Ижевск', '98': 'Ульяновск', '99': 'Уфа', '102': 'Хабаровск', '103': 'Абакан',
        '104': 'Челябинск', '105': 'Грозный', '106': 'Чита', '107': 'Чебоксары', '112': 'Ярославль',
        '130': 'Севастополь', '131': 'Симферополь'}

for id_city, city in city.items():
    cities()
